// *++
//
// Copyright (c) 2004 - 2009, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   ChipsetConfigStrings.uni
//
// Abstract:
//
//   String definitions for chipset cfg pages.
//
// --*/

/=#

#langdef en-US "English"

#string STR_CC_BANNER                                 #language en-US  "Chipset config"
#string STR_HELP_FOOTER                               #language en-US  "Arrow keys to change option, ENTER to select an option, ESC to exit"
#string STR_BOOT_OPTION_BANNER                        #language en-US  "Boot Option Menu"
#string STR_LAST_STRING                               #language en-US  ""

#string STR_WAIT_FOR_CC_START                         #language en-US  "Please wait while chipset config is starting up..."

#string STR_USB_LEGACY_SUPPORT                 #language en-US "USB Legacy Support"

#string STR_USB_LEGACY_SUPPORT_ENABLE          #language en-US "Enable"

#string STR_USB_LEGACY_SUPPORT_DISABLE         #language en-US "Disable"

#string STR_USB_LEGACY_SUPPORT_HELP            #language en-US "Enable/Disable"

#string STR_PXE_OPROM_SWITCH                   #language en-US "PXE OpROM"

#string STR_PXE_OPROM_SWITCH_ENABLE            #language en-US "Enable"

#string STR_PXE_OPROM_SWITCH_DISABLE           #language en-US "Disable"

#string STR_PXE_OPROM_SWITCH_HELP              #language en-US "Enable/Disable"

#string STR_SATA_MODE                          #language en-US "SATA controller mode"

#string STR_SATA_MODE_IDE                      #language en-US "IDE"

#string STR_SATA_MODE_AHCI                     #language en-US "AHCI"

#string STR_SATA_MODE_HELP                     #language en-US "AHCI=Advanced Host Controller Interface, IDE=Legacy mode"

#string STR_SATA_AHCI_SLOW                     #language en-US "Slow-starting SATA devices compatibility mode"

#string STR_SATA_AHCI_SLOW_ENABLE              #language en-US "Enable"

#string STR_SATA_AHCI_SLOW_DISABLE             #language en-US "Disable"

#string STR_SATA_AHCI_SLOW_HELP                #language en-US "Enable/Disable"

#string STR_VIDEO                              #language en-US "Videocard"

#string STR_VIDEO_IGD                          #language en-US "IGD+PEG"
											   
#string STR_VIDEO_IGD_HELP                     #language en-US "Integrated graphics drivers"
											   
#string STR_VIDEO_PEG                          #language en-US "PEG+IGD"
											   
#string STR_VIDEO_PEG_ONLY                     #language en-US "PEG"
											   
#string STR_VIDEO_PEC_HELP                     #language en-US "PCI-E video card"
											   
#string STR_VIDEO_HELP                         #language en-US "IGD=Integrated graphics drivers, PEG=PCI-E video card"
											   
#string STR_USB_PORTS_SETTINGS                 #language en-US "USB-ports settings"
											   
#string STR_USB_PORTS_SETTINGS_BTN             #language en-US "USB-ports settings"
											   
#string STR_USB_PORT                           #language en-US "USB-port"
											   
#string STR_USB_PORT_CFG_HELP                  #language en-US "USB-port on/off"
											   
#string STR_PS2_PORT                           #language en-US "PS/2-port"
											   
#string STR_PS2_PORT_CFG_HELP                  #language en-US "PS/2-port on/off"
                                               
#string STR_VGA_SUPPORT_CFG                    #language en-US "Vga Support"
                                               
#string STR_VGA_SUPPORT_CFG_HELP               #language en-US "Legacy Video ROM/EFI GOP Driver"
                                               
#string STR_VGA_USE_VIDEO_ROM                  #language en-US "Video ROM"
                                               
#string STR_VGA_USE_GOP_DRIVER                 #language en-US "EFI GOP driver"
                                               
#string STR_DISABLE_SERIAL_CON                 #language en-US "Disable serial console"
                                               
#string STR_DISABLE_SERIAL_CON_HELP            #language en-US "Disable serial console (need reboot)"
											   
#string STR_SERIAL_CONSOLE_TYPE                #language en-US "Terminal type"

#string STR_SERIAL_CONSOLE_PC_ANSI             #language en-US "PC ANSI"

#string STR_SERIAL_CONSOLE_VT100               #language en-US "VT100"

#string STR_SERIAL_CONSOLE_VT100_PLUS          #language en-US "VT100+"

#string STR_SERIAL_CONSOLE_UTF8                #language en-US "UTF-8"

#string STR_SERIAL_CONSOLE_TYPE_HELP           #language en-US "Change terminal type (need reboot)"

#string STR_REBOOT_REQUIRE                     #language en-US "Parameters to take effect requires a reboot"
